[{"BLNumber": "O/007/21", "ConcerningRightsIn": "GB1618927.6", "HearingOfficer": "Mr P Thorpe", "DecisionDate": "2021-01-06T00:00:00", "PersonOrCompanyInvolved": "Lenovo (Singapore) Pte. Ltd", "ProvisionsDiscussion": "Patents Act 1977 S1(2)", "HearingType": "Ex", "Keywords": "Excluded fields (refused)", "RelatedDecisions": "None", "Summary": "The invention relates to projecting battery usage on a device such as a computer or mobile phone. More specifically, it involves determining an estimated length of time for which a battery will power an apparatus based on a user selection of applications that they desire to use concurrently and on how long they wish to use each application for. Applying the Aerotel approach, the Hearing Officer found the invention to be excluded as a program for a computer. The application was refused.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O00721.pdf", "Status": "Activated"}, {"BLNumber": "O/035/21", "ConcerningRightsIn": "GB 2007535.4", "HearingOfficer": "Mrs C L Davies", "DecisionDate": "2021-01-14T00:00:00", "PersonOrCompanyInvolved": "Tate and Lyle Technology Limited and Tate & Lyle Ingredients Americas LLC", "ProvisionsDiscussion": "Patents Act 1977 Section 1(1)(b)", "HearingType": "Ex", "Keywords": "Inventive step", "RelatedDecisions": "None", "Summary": "The invention concerns a protein comprising a polypeptide that has at least 90% sequence identity with but is not identical to a peptide sequence identified as SEQ ID NO: 6 and which has psicose 3-epimerase activity. Nucleic acids encoding this peptide, vectors and host cells comprising the encoding nucleic acid are further claimed. This enzyme catalyses the interconversion of fructose to allulose.The examiner, based on the prior art disclosure of SEQ ID NO:6 in protein databases and the common general knowledge of the skilled person, asserted that the invention was obvious. The applicants disagreed with the examiner’s starting point for assessing obviousness and assessment of the common general knowledge and maintained their assertion that there was an inventive step to arrive at the claimed invention.Having carefully considered the arguments, observations and evidence presented, the Hearing Officer agreed with the applicants’ assessment of the common general knowledge of the skilled person and the starting point for assessing obviousness. In the light of this following the Windsurfing/Pozzoli approach, the Hearing Officer found that the claims 1-9 required an inventive step over the prior art.The application was remitted back to the examiner for completion of the examination process and grant.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O03521.pdf", "Status": "Activated"}, {"BLNumber": "O/037/21", "ConcerningRightsIn": "GB1612429.9", "HearingOfficer": "Miss J Pullen", "DecisionDate": "2021-01-14T00:00:00", "PersonOrCompanyInvolved": "Smartglyph Limited", "ProvisionsDiscussion": "Patents Act 1977 sections 1(2)", "HearingType": "Ex", "Keywords": "Excluded fields (refused)", "RelatedDecisions": "None", "Summary": "The invention relates to a system for scanning codes and to a system for augmenting scannable codes to provide enhanced information and content. When an element is scanned a check is performed to see whether the information in the element is associated with a two-dimensional code in a database. When a match is found, the two-dimensional code is decoded and a vector is provided to identify rich media, such as videos, images and documents, that are then forwarded to the scanning device.The hearing officer rejected the applicant’s construction of the claim and found that the contribution related to the linking of the scannable element to the two-dimensional code in the database and this does not make a technical contribution. The application was refused as a program for a computer as such under section", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O03721.pdf", "Status": "Activated"}, {"BLNumber": "O/042/21", "ConcerningRightsIn": "GB1714567.3", "HearingOfficer": "Mr P Mason", "DecisionDate": "2021-01-14T00:00:00", "PersonOrCompanyInvolved": "David John Jones", "ProvisionsDiscussion": "Patents Act 1977 Section 14(3), Section 14(5)(b) and Section 76(2)", "HearingType": "Ex", "Keywords": "Added subject matter, Clarity, Sufficiency", "RelatedDecisions": "None", "Summary": "The application concerns a profile for a bricklayer’s tool. The tool comprises a staff, a clamp, and an arrangement of bolts and handwheels to allow positioning. The main claim is directed to extrusion dies to produce said tool. The hearing officer considered whether the invention was sufficiently disclosed as required by Section 14(3); whether the amended claim disclosed added matter as set out in Section 76(2); and whether the amended claim clearly defined the scope of the invention as required by Section 14(5)(b). The hearing officer found that the application was not sufficiently disclosed and was not clear enough to be performed by a skilled addressee. As such it was not necessary to give further consideration of the added subject matter. The application was refused under Section 18(3).", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O04221.pdf", "Status": "Activated"}, {"BLNumber": "O/045/05", "ConcerningRightsIn": "GB 2371653", "HearingOfficer": "Mr D J Barford", "DecisionDate": "2005-03-01T00:00:00", "PersonOrCompanyInvolved": "M-Systems Flash Disk Pioneers Ltd v Trek Technology (Singapore) Pte Ltd", "ProvisionsDiscussion": "PA.1977 sections 72, 75", "HearingType": "Inter", "Keywords": "Amendment, Disclosure, Novelty, Revocation", "RelatedDecisions": "O/093/04, O/296/04", "Summary": "At a preliminary hearing in revocation and amendment proceedings, the defendant (Trek) requested that the substantive hearing be postponed in view of deficiencies in the claimant’s (M-Systems) statement of case, namely that:a) the pleadings were in general in a mess, andb) PCT application WO 00/42491 had not been properly pleaded against noveltyThe hearing officer refused to postpone the substantive hearing acknowledging thata) although the pleadings were unfocussed, the defendant knew the case that it had to answer; andb) although the document in question had not been explicitly pleaded against novelty from the outset, the defendant should have been well aware of its importance, and in any case had addressed the issue of its relevance to novelty in the counterstatementOther issues addressed:· a request by the claimant for documents obtained by disclosure in related proceedings in Singapore with withdrawn at the hearing· the defendant’s submission that, through an irregularity in procedure by the Patent Office, it had not been given an opportunity to address the novelty issue regarding WO 00/42491, was held - even if valid - not to have materially prejudiced its case in the circumstances.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O04505.pdf", "Status": "Activated"}, {"BLNumber": "O/045/21", "ConcerningRightsIn": "GB1505456.2", "HearingOfficer": "Miss J Pullen", "DecisionDate": "2021-01-15T00:00:00", "PersonOrCompanyInvolved": "Renaissance Technologies LLC", "ProvisionsDiscussion": "Section 1(2)", "HearingType": "Ex", "Keywords": "Excluded fields (refused)", "RelatedDecisions": "None", "Summary": "The invention relates to a computer-based financial trading system and method capable of executing time synchronized trades in multiple exchanges. The system includes a plurality of servers co-located at the financial exchanges and a trading server. The trading server sends multiple financial trade instructions containing orders and an execution time to each of the co-located servers to be submitted to the financial exchange at the execution time whereby the orders are received at the exchanges substantially simultaneously.The Hearing Officer applied the Aerotel/Macrossan four step test, considered the AT&T/CVON signposts and found that the contribution fell within the excluded categories of a business method and a computer program as such. The application was refused under section 18(3).", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O04521.pdf", "Status": "Activated"}, {"BLNumber": "O/052/05", "ConcerningRightsIn": "GB0312325.4", "HearingOfficer": "Mr P Thorpe", "DecisionDate": "2005-03-09T00:00:00", "PersonOrCompanyInvolved": "Chicago Mercantile Exchange, Inc.", "ProvisionsDiscussion": "PA Section 1(2)(c)", "HearingType": "Ex", "Keywords": "Excluded fields (refused)", "RelatedDecisions": "None", "Summary": "The application relates to a computer implemented method of trading derivatives. The applicant argued that the use of a network managing station to match up potential buyers and sellers reduced the amount of data communicated in the system. This was claimed to be a technical solution to a technical problem. Also argued that providing direct communication between the parties rather than routing communications through a server of a central exchange also provided a technical contribution.Held that the implementation did not involve any technical contribution and that therefore the application was excluded from patentability as a method of doing business and as a program for a computer as such.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O05205.pdf", "Status": "Activated"}, {"BLNumber": "O/055/05", "ConcerningRightsIn": "GB 0019522.2", "HearingOfficer": "Mr P Marchant", "DecisionDate": "2005-03-04T00:00:00", "PersonOrCompanyInvolved": "Citibank N.A.", "ProvisionsDiscussion": "PA. 1977 Section 1(2)", "HearingType": "Ex", "Keywords": "Excluded fields (refused)", "RelatedDecisions": "None", "Summary": "The invention concerns the detection of abnormalities in input data to financial risk management systems. The system compares the information content of input data with historical input data and uses statistical methods to determine the likelihood that changes in the input data are the result of one or more errors in the data rather than authentic variations. The hearing officer found that the invention fell within the excluded fields set out in section 1(2) of the Act and did not involve a technical contribution since the detection of errors in data was a mathematical rather than a technical activity.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O05505.pdf", "Status": "Activated"}, {"BLNumber": "O/055/21", "ConcerningRightsIn": "GB1720232.6", "HearingOfficer": "Mr H Jones", "DecisionDate": "2021-01-21T00:00:00", "PersonOrCompanyInvolved": "Motorola Solutions Inc.", "ProvisionsDiscussion": "Section 1(2)(c)", "HearingType": "Ex", "Keywords": "Excluded fields (refused)", "RelatedDecisions": "None", "Summary": "The invention relates to automatically matching ‘user profiles’ to ‘role profiles’ in an emergency incident using machine learning to optimise the deployment of the individuals (‘users’) to the different roles. The computer-based system uses a ‘combinatorial optimisation routine’ to automatically assign particular roles to each user profile using a suitability score. The suitability score is calculated using user profile data (e.g. training records, user experience), and the geographical location of the user. Each user has a communications device which is used to inform them of their assignment. The user devices can function differently depending on the role assigned, and the system is adaptive so that should the incident requirements change, the users can be deployed/redeployed differently.Having assessed the problem addressed by the invention as ensuring efficient allocation of personnel in an incident based on the information available and in providing personnel with the relevant tools to perform their roles effectively, the hearing officer found the invention to be excluded as a computer program and a method of doing business. The application was refused.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O05521.pdf", "Status": "Activated"}, {"BLNumber": "O/056/05", "ConcerningRightsIn": "GB 2330747 B", "HearingOfficer": "Mr P Back", "DecisionDate": "2005-03-04T00:00:00", "PersonOrCompanyInvolved": "Eugenie Dergeyevich Aleshin v Sony United Kingdom Ltd.", "ProvisionsDiscussion": "PA 1977 section 37 (1); section 72", "HearingType": "Inter", "Keywords": "Abuse of process, Entitlement, Revocation, Striking out", "RelatedDecisions": "None", "Summary": "Mr. Aleshin had argued that Sony has stolen his invention and that it had been passed to them by his then Russian patent attorney. Sony had asked for a decision on the papers for the action to be struck out as having no chance of success and as an abuse of process. Mr. Aleshin agreed to a decision on the papers filed. It was decided that Sony had no case to answer, that there was no evidence that Sonys invention made any use of anything Mr. Aleshin had invented and that most of what Mr Aleshin had disclosed was already in the public domain when he filed his application. Accordingly, the case was stuck out for want of any reasonable chance of success. No finding was made on the abuse of process issue.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O05605.pdf", "Status": "Activated"}, {"BLNumber": "O/057/21", "ConcerningRightsIn": "GB1713282.0", "HearingOfficer": "Miss J Pullen", "DecisionDate": "2021-01-22T00:00:00", "PersonOrCompanyInvolved": "Kira Inc.", "ProvisionsDiscussion": "Patents Act 1977 section 1(2)", "HearingType": "Ex", "Keywords": "Excluded fields (refused)", "RelatedDecisions": "None", "Summary": "The invention relates to searching through an electronic text document for passages relating to a desired concept by using a conditional random field algorithm (a class of statistical modelling). A set of training texts are deconstructed by a computer processor to extract features including the text of complete sentences, tokens used in those sentences, the sequencing of those sentences, and the layout and typography of the text. The conditional random field algorithm applies one of two labels to each sentence: relevant to the concept being searched for (also known as “State A”), or background information (“State B”). A search algorithm then returns all those sentences which have been labelled with “State A”, i.e. those sentences relevant to the concept being searched for.Applying the Aerotel approach, the Hearing Officer found the contribution fell within the excluded matter as a program for a computer as such. The application was refused.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O05721.pdf", "Status": "Activated"}, {"BLNumber": "O/058/05", "ConcerningRightsIn": "GB 0318627.7", "HearingOfficer": "Mrs S E Chalmers", "DecisionDate": "2005-03-04T00:00:00", "PersonOrCompanyInvolved": "Educational Testing Services", "ProvisionsDiscussion": "Section 1 (2) (c)", "HearingType": "Ex", "Keywords": "Excluded fields (refused)", "RelatedDecisions": "None", "Summary": "The application relates to a computerised method of analysing an essay to provide eg a thesis statement and comprises a computer program which looks for predefined words, phrases, sentence positions, etc and uses predefined probabilities to pick out a sentence which contains eg the thesis statement.It was held that the invention claimed in the specification was a method of performing a mental act and/or a computer program and that there was no technical contribution that would prevent its exclusion from patentability.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O05805.pdf", "Status": "Activated"}, {"BLNumber": "O/064/05", "ConcerningRightsIn": "GB0017772.5", "HearingOfficer": "Mr H Jones", "DecisionDate": "2005-03-14T00:00:00", "PersonOrCompanyInvolved": "Shopalotto.com Limited", "ProvisionsDiscussion": "PA.1977 sections 1(2)(c) and 1(2)(d); Official Ruling 1926A", "HearingType": "Ex", "Keywords": "Excluded fields (refused)", "RelatedDecisions": "None", "Summary": "The application relates to an Internet lottery game in which the usual numbers are replaced with brand representations of commercial products or services. The invention allows products or services to be advertised to players playing the game and for the lottery operator to charge the brand owner for the privilege. It was argued that the substance of the invention was an apparatus for playing a game and was not excluded by section 1(2). The Hearing Officer found that the substance of the invention was the mere presentation of information which fell within the section 1(2)(d) exclusion. He failed to find a technical contribution that would make such an excluded invention patentable.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O06405.pdf", "Status": "Activated"}, {"BLNumber": "O/065/21", "ConcerningRightsIn": "GB1900276.5", "HearingOfficer": "Mr B Buchanan", "DecisionDate": "2021-01-28T00:00:00", "PersonOrCompanyInvolved": "Alexander Scott Ross", "ProvisionsDiscussion": "Sections 1(1)(c), 4(1) and 14(3) of the Patents Act 1977", "HearingType": "Ex", "Keywords": "Industrial application, Sufficiency", "RelatedDecisions": "None", "Summary": "The claimed invention relates to a system for propelling a space craft. The invention works by using a non-contacting magnetic coupling between a motor-driven wheel, and the hull of the space craft, to exert a force on the hull of the craft. The motor is fixed to the hull of the space craft so that if the space craft moves, the motor and wheel move with it. The alleged advantage when used in space is that by using magnets, without direct mechanical contact between each wheel and the hull, there is no reaction to the force on the hull applied by the magnetic wheel as it rotates. This then, allegedly, means that the craft experiences no resistance to thrust and continuously accelerates while the force is applied.The Hearing Officer considered the alleged principle of operation defined by the claims and found it was contrary to well-established physical laws. Consequently, he found that the application failed to meet the requirements for industrial application and sufficiency and refused the application under section 18(3).", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O06521.pdf", "Status": "Activated"}, {"BLNumber": "O/066/05", "ConcerningRightsIn": "GB 2376437", "HearingOfficer": "Mr R C Kennell", "DecisionDate": "2005-03-15T00:00:00", "PersonOrCompanyInvolved": "British Numberplate Manufacturers Association v Hills Numberplates Limited", "ProvisionsDiscussion": "PA.1977 sections 7, 72(1), 107, 130(7); Interpretation Act 1978 section 5", "HearingType": "Inter", "Keywords": "Costs, Revocation", "RelatedDecisions": "None", "Summary": "Preliminary decisionPA section 72(1) allows 'any person' to apply for revocation and the Interpretation Act 1978 section 5 defines 'person' as including 'a body of persons ... unincorporate' (subject to a contrary intention in the Act in question). However - distinguishing Oystertec plcs Patent [2003] RPC 29 to the effect that Parliament intended 'anyone' to be able to apply for revocation - the hearing officer held that the claimant (BNMA) as an unincorporated association was not entitled to apply in its own name in the light of general case law to the effect that an unincorporated association could not bring any proceedings. He did not accept (i) that a contrary intention could be found via PA section 130(7) and the interpretation of analogous provisions of the EPC by the EPO Boards of Appeal, or (ii) that section 72(1) should necessarily be interpreted by the Patent Office in the same way as PA section 7 to exclude unincorporated associations.The hearing officer was prepared to allow the application to proceed in with the substitution of another applicant, subject to a guarantee in relation to costs already incurred in the proceedings and to the payment of costs in respect of the preliminary hearing. He declined to require the individual members of the BNMA to be bound by the decision of the comptroller if the application did proceed. He also saw no justification at present for security for costs higher than the £2000 already offered by the claimant.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O06605.pdf", "Status": "Activated"}, {"BLNumber": "O/067/05", "ConcerningRightsIn": "GB 2308227", "HearingOfficer": "Mrs S Williams", "DecisionDate": "2005-03-18T00:00:00", "PersonOrCompanyInvolved": "Micromass Limited, Stevan Bajic and Roger Giles", "ProvisionsDiscussion": "PA Act 1977 Section 13(1)", "HearingType": "Inter", "Keywords": "Inventorship", "RelatedDecisions": "None", "Summary": "As a result of an uncontested application filed under section 13(1) by Roger Giles, it was found that he should be mentioned as a joint inventor in the granted patent and directed that an addendum slip mentioning him as a joint inventor be prepared for the published patent application and for the granted patent for the invention.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O06705.pdf", "Status": "Activated"}, {"BLNumber": "O/068/05", "ConcerningRightsIn": "GB 0312704.0", "HearingOfficer": "Mr B Cleary", "DecisionDate": "2005-03-17T00:00:00", "PersonOrCompanyInvolved": "Trek 2000 International Ltd, Chong Seng Cheng and Teng Pin Poo", "ProvisionsDiscussion": "PA Act 1977 Section 13(1)", "HearingType": "Inter", "Keywords": "Inventorship", "RelatedDecisions": "None", "Summary": "As a result of an uncontested application filed under section 13(1) by Teng Pin Poo, it was directed that addendum slips mentioning him as a joint inventor be prepared for the published application of the patent and the granted patent.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O06805.pdf", "Status": "Activated"}, {"BLNumber": "O/073/05", "ConcerningRightsIn": "GB 2366358", "HearingOfficer": "Mr D J Barford", "DecisionDate": "2005-03-21T00:00:00", "PersonOrCompanyInvolved": "Applied Energy Products Limited v Zip Heaters (UK) Limited", "ProvisionsDiscussion": "PA Act 1977 sections 72, 65", "HearingType": "Inter", "Keywords": "Certificate of contested validity, Claim construction, Costs, Evidence, Inventive step, Novelty, Revocation, Sufficiency", "RelatedDecisions": "None", "Summary": "The claimant applied for revocation on the grounds (a) that the invention is not new and does not involve an inventive step; and (b) that the specification does not disclose the invention clearly enough and completely enough for it to be performed by a person skilled in the art. Claims A, B, C and D were offered by way of amendment.The hearing officer found prior use against claim 1 and against claims A and B. He also found that certain of the appendant claims fell on grounds (a), despite a certain lack of evidence from the claimant. However he found that claim C was allowable as was claim 1 amended to incorporate certain other appendant claims. He found against the claimant on grounds (b).Consideration of a request for a certificate of contested validity was deferred pending satisfactory amendment.Costs were awarded to the claimant, the defendant's argument that when determining costs account should be taken of the claimant's failure to communicate with the defendant prior to filing the application for revocation was dismissed.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O07305.pdf", "Status": "Activated"}, {"BLNumber": "O/075/05", "ConcerningRightsIn": "EP(UK) 1082401", "HearingOfficer": "Mr M C Wright", "DecisionDate": "2005-03-22T00:00:00", "PersonOrCompanyInvolved": "Dedar Limited", "ProvisionsDiscussion": "PA.1977, Section 28(3)", "HearingType": "Ex", "Keywords": "Restoration", "RelatedDecisions": "None", "Summary": "Faced with financial difficulties, the Managing Director of Dedar Ltd, Mr Michael Ling decided to delay paying the renewal fee until he had entered into an agreement with another company which had undertaken to provide funds to cover the renewal fee once the agreement had been finalise. The agreement was settled the day before the last day of the six month period allowed for paying the fee with extension fees. Mr Ling knew he would be tied up with an important meeting the following day and so sent instructions to pay by e-mail to his patent agents as soon as the agreement had been concluded, i.e. the evening before the last day for payment. However, unbeknown to him his e-mail account had not been reinstated despite the fact he had paid for it to be reinstated several weeks earlier. The Hearing Office took the view that the action Mr Ling took to avoid impecuniosity by ensuring he had the necessary funds and to issue instructions to pay immediately thereafter and before he would be engaged in important business discussions was reasonable in the circumstances. Moreover, he was satisfied that Mr Ling could not have foreseen that his e-mail account had not been reinstated particularly as the email provider confirmed that Mr Ling would have had good reason to believe it had been restored. The Hearing Officer was therefore satisfied that Mr Ling had exercised the degree of care which would have been reasonable under the circumstances and allowed restoration.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O07505.pdf", "Status": "Activated"}, {"BLNumber": "O/076/05", "ConcerningRightsIn": "GB 2342462", "HearingOfficer": "Mr P Thorpe", "DecisionDate": "2005-03-29T00:00:00", "PersonOrCompanyInvolved": "Keymed (Medical & Industrial Equipment) Limited v Tokendo (S.A.R.L.) and Jean Revegno", "ProvisionsDiscussion": "PA.1977 section 72", "HearingType": "Inter", "Keywords": "Revocation", "RelatedDecisions": "None", "Summary": "The applicant for revocation did not wish to pursue the application. The objections raised were considered and no order for revocation was made.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O07605.pdf", "Status": "Activated"}, {"BLNumber": "O/077/05", "ConcerningRightsIn": "EP (UK) 1148875", "HearingOfficer": "Mrs S Williams", "DecisionDate": "2005-03-22T00:00:00", "PersonOrCompanyInvolved": "AnorMed Inc, Ronald Trevor MacFarland, Andrew W Miller, Gary J Bridger, Michael J Abrams and Geoffrey W Henson", "ProvisionsDiscussion": "PA. Act 1977 Section 13(1)", "HearingType": "Inter", "Keywords": "Inventorship", "RelatedDecisions": "None", "Summary": "As a result of an uncontested application filed under section 13(1) by AnorMed Inc, it was found that Gary J Bridger, Michael J Abrams and Geoffrey W Henson should be mentioned as joint inventors in granted patent EP (UK) 1148875 and directed that an addendum slip mentioning them as joint inventors be prepared for the granted patent for the invention.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O07705.pdf", "Status": "Activated"}, {"BLNumber": "O/078/05", "ConcerningRightsIn": "GB 0314464.9", "HearingOfficer": "Mrs S E Chalmers", "DecisionDate": "2005-03-22T00:00:00", "PersonOrCompanyInvolved": "Neal William Macrossan", "ProvisionsDiscussion": "Section 1 (2) (c)", "HearingType": "Ex", "Keywords": "Excluded fields (refused)", "RelatedDecisions": "None", "Summary": "The application relates to a computerised method for creating the required legal documents to incorporate a business entity using a data processing system. The computer is programmed to ask questions of a user, the answers to which determine further questions to be answered. This process is repeated until the user has provided enough information to allow the computer to generate the documents by merging document templates with the users answers.The HO considered that the invention claimed related to an 'expert system' in that, by providing a guided question session and giving expert advice in the sense of creating the necessary documents, the computer was standing in for a human legal advisor. She held that the invention was therefore a method of performing a mental act, a method for doing business business and a computer program and that there was no technical contribution that would prevent its exclusion from patentability Wang Laboratories Incs Application [1991] RPC 463 followed.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O07805.pdf", "Status": "Activated"}, {"BLNumber": "O/085/05", "ConcerningRightsIn": "EP(UK) 0483578 B1", "HearingOfficer": "Mr S N Dennehey", "DecisionDate": "2005-03-30T00:00:00", "PersonOrCompanyInvolved": "Cormon Limited v Norsk Hydro a.s.", "ProvisionsDiscussion": "PA.1977 section 71", "HearingType": "Inter", "Keywords": "Claim construction, Infringement", "RelatedDecisions": "None", "Summary": "The patent relates to a method and apparatus for detecting the amount of particles flowing in a fluid stream based on the principle that the electrical resistance of an erosion element placed in the stream will change as a result of its gradual erosion by the particles. C sought a declaration of non-infringement in respect of its own CMEP 026 and CMEP 024 erosion probes. D questioned whether full particulars of the infringing act had been provided by C.The hearing officer found that the technical data sheets provided by C did give a clear and unambiguous description on which to decide whether Cs probes fell within the scope of the patent. He went on to find that Cs probes did not infringe the method and apparatus claims. Ds argument that the supply of multiple probes modified or configured in a partiuclar way might lead to contributory infringement of the patent was rejected by the hearing officer.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O08505.pdf", "Status": "Activated"}, {"BLNumber": "O/086/05", "ConcerningRightsIn": "GB 2321389", "HearingOfficer": "Mr D McMunn", "DecisionDate": "2005-03-29T00:00:00", "PersonOrCompanyInvolved": "Tegometall (International) Sales GmbH v Nigel Anthony Bass", "ProvisionsDiscussion": "PA.1977 Section 72(1)", "HearingType": "Inter", "Keywords": "Revocation", "RelatedDecisions": "None", "Summary": "Following the withdrawal of the application by the patent applicants, it was decided to make no order for revocation of the patent.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O08605.pdf", "Status": "Activated"}, {"BLNumber": "O/087/05", "ConcerningRightsIn": "GB2352475, GB2362428 and related patent applications", "HearingOfficer": "Mr P Hayward", "DecisionDate": "2005-03-31T00:00:00", "PersonOrCompanyInvolved": "Bio Pure Technology Ltd v (1) Jarzon Plastics Ltd and (2) Anthony Elliott", "ProvisionsDiscussion": "PA.1977 sections 7, 12, 13, 37", "HearingType": "Inter", "Keywords": "Contract, Entitlement, Inventorship", "RelatedDecisions": "None", "Summary": "Bio Pure had approached Jarzon about a new plastics clamp they wished to produce. Following discussions between the two sides, Jarzon produced drawings which incorporated the main invention of the patents and applications in suit. The Hearing Officer held that:1. There was a contract between Bio Pure and Jarzon for the production of those drawings.2. To make business sense of that contract, it was necessary to imply a term that any patent rights belonged to Bio Pure (Robin Ray v Classic FM plc [1998] FSR 622 and other case law considered).3. The main invention had in any case been devised by someone on Bio Pure's side, not by the named inventor Mr Elliott who worked for Jarzon.A ruling on whether there were any significant features covered by subordinate claims which justified Mr Elliott being named as a co-inventor, and if so, whether that gave Jarzon any rights in respect of those features, was deferred pending further submissions.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O08705.pdf", "Status": "Activated"}, {"BLNumber": "O/107/05", "ConcerningRightsIn": "EP (UK) 1037615", "HearingOfficer": "Mrs S Williams", "DecisionDate": "2005-04-21T00:00:00", "PersonOrCompanyInvolved": "Noven Pharmaceuticals Inc, Juan Mantelle, Terese A Dixon and David P Kanios", "ProvisionsDiscussion": "PA 1977 Section 13(1)", "HearingType": "Inter", "Keywords": "Inventorship", "RelatedDecisions": "None", "Summary": "As a result of an uncontested application filed under section 13(1) by David P Kanios, it was found that he should be mentioned as a joint inventor in the granted EP (UK) patent and directed that an addendum slip mentioning him as a joint inventor be prepared for the granted patent for the invention.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O10705.pdf", "Status": "Activated"}, {"BLNumber": "O/111/05", "ConcerningRightsIn": "Mr R Walker", "HearingOfficer": "22 April 2005", "DecisionDate": null, "PersonOrCompanyInvolved": "None", "ProvisionsDiscussion": "None", "HearingType": "Inter", "Keywords": null, "RelatedDecisions": null, "Summary": "", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O11105.pdf", "Status": "Activated"}, {"BLNumber": "O/123/05", "ConcerningRightsIn": "GB 0220042.6", "HearingOfficer": "Mrs S Williams", "DecisionDate": "2005-05-03T00:00:00", "PersonOrCompanyInvolved": "Mr Olaf Rock, Telectra Ltd, Alan Frank Parker, Donald Keri Rees and Ian Chisholm Hipkins", "ProvisionsDiscussion": "Section 13(1) and Section 13(3)", "HearingType": "Inter", "Keywords": "Inventorship", "RelatedDecisions": "None", "Summary": "Following the filing of an application under section 13(1) and 13(3), and consent being filed by Ian Chisholm Hipkins, Donald Keri Rees and Alan Frank Parker, the application was allowed. It was found that Alan Frank Parker should be named as sole inventor in the published patent application and any patent granted for the invention. It was also directed that an addendum slip be prepared for the published application; the slip will mention Alan Frank Parker as sole inventor and state that Ian Chisholm Hipkins should not have been named as inventor. The decision serves as a certificate to the effect that Ian Chisholm Hipkins should not have been named as an inventor in the published patent application for the invention.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O12305.pdf", "Status": "Activated"}, {"BLNumber": "O/124/05", "ConcerningRightsIn": "GB0114021.9", "HearingOfficer": "Mr H Jones", "DecisionDate": "2005-05-04T00:00:00", "PersonOrCompanyInvolved": "Fujitsu Limited", "ProvisionsDiscussion": "PA. 1977 section 1(2)(c); PR 1995 rule 100", "HearingType": "Ex", "Keywords": "Excluded fields (refused)", "RelatedDecisions": "None", "Summary": "The application relates to a system for monitoring and updating delivery schedules based on real-time feedback of completed deliveries and changes made by customers. The system creates a delivery schedule to be followed by a delivery person and can re-calculate the estimated delivery times of remaining deliveries after a delivery has completed and the actual delivery time has been entered into the system. The Hearing Officer found that the substance of the invention was a method of doing business embodied in computer software which fell within the exclusions of section 1(2)(c). He failed to find a technical contribution that would make such an excluded invention patentable.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O12405.pdf", "Status": "Activated"}, {"BLNumber": "O/129/05", "ConcerningRightsIn": "GB2286521", "HearingOfficer": "Mr M C Wright", "DecisionDate": "2005-05-06T00:00:00", "PersonOrCompanyInvolved": "Mrs Jennifer Morrison Holdham", "ProvisionsDiscussion": "Patents Act 1977, Section 28(3)", "HearingType": "Ex", "Keywords": "Restoration", "RelatedDecisions": "None", "Summary": "The proprietor argued that health problems, stress and lack of funds contributed to her not paying the renewal fee. However, she failed to furnish supporting evidence from a medical practitioner confirming that her health and stress related problems were such as to affect her ability to act in a reasonable manner and to pay the renewal fee. To the contrary, there was ample evidence that she was actively engaged in numerous and demanding tasks at the time the renewal fee could have been paid. Moreover, there is clear evidence that she was preoccupied with preparing to display the product covered by her patent at exhibitions and devoted much of her efforts to securing funds for that purpose. However, there is no evidence that she made diligent efforts to obtain funds specifically to pay the renewal fee. There was also a suggestion that she may have had doubts about maintaining her patent. The Hearing Officer was therefore not persuaded that the proprietor took reasonable care to see that the renewal fee was paid and refused to allow restoration.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O12905.pdf", "Status": "Activated"}, {"BLNumber": "O/132/05", "ConcerningRightsIn": "GB 2351111", "HearingOfficer": "Mr P Hayward", "DecisionDate": "2005-05-12T00:00:00", "PersonOrCompanyInvolved": "Roger Michael Elliott and BSP International Foundations Ltd v Expotech Ltd", "ProvisionsDiscussion": "PA 1977 sections13, 37", "HearingType": "Inter", "Keywords": "Entitlement", "RelatedDecisions": "O/095/04, O/189/04", "Summary": "The hearing officer had previously ruled that the patent included two inventions, one of which belonged in principle to BSP whilst the other belonged to Expotech, and that two companies were to have joint ownership with cross licensing on an equal basis. This decision was settling the details of the licence terms. The parties had argued for wildly different royalty rates, but the hearing officer decided that because of the international character of the market, there would be least risk of unfairness if he set the cross royalty rate at zero.Because of the very poor relations between the parties and the possibility that one of the inventions might later be found to be unpatentable, he also (a) granted declaratory relief in order to set a clearer framework for any later disputes, (b) allowed either party to apply to amend the patent even if the other party did not agree. He declined to include undertakings that the parties would not enforce foreign patents in respect of machines exported from the UK.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O13205.pdf", "Status": "Activated"}, {"BLNumber": "O/138/05", "ConcerningRightsIn": "SPC/GB/01/151", "HearingOfficer": "Mr R Walker", "DecisionDate": "2005-05-19T00:00:00", "PersonOrCompanyInvolved": "Knoll AG", "ProvisionsDiscussion": "Council Regulation (EEC) No. 1768/92, Article 3; Council Regulation (EC) No. 1610/96, Article 3(2)", "HearingType": "Ex", "Keywords": "Supplementary Protection Certificates", "RelatedDecisions": "None", "Summary": "The applicant filed two co-pending applications relating to the same product based upon common marketing authorizations, but different basic patents. One application was granted and the applicant was invited to withdraw the other application. The applicant argued that under a literal interpretation of Article 3(c) of the Medicinal Products Regulation there was no objection and that this application should be allowed. The applicant further argued that using Article 3(2) of the Plant Protection Regulation to interpret Article 3 of the current Regulation was illegitimate and thus it could not be relied upon. Furthermore, the applicant argued that interpreting Article 3 in the light of Article 3(2) was contrary to the purpose of the Regulation since it reduced, not promoted, the ability of a patent holder to obtain supplementary protection. The applicant also argued that by not allowing the applicant a further certificate they were being treated inequitably and that an uniform solution at Community level, whereby certificates were granted under the same conditions, would not be achieved if the holder of more than one patent were denied the right to be granted more than one certificate, whilst a plurality of certificates for the same product could be granted on the basis of different patents in the hands of two or more holders. The hearing officer rejected these arguments finding that the Regulation did provide a uniform and equitable solution whereby one certificate may be granted under the same conditions to any holder of one or more patents which protect the product in question. Moreover, this is also wholly consistent with Article 3(2) of the Plant Protection Products Regulation, which he was bound to consider in interpreting Article 3. Consequentially, it was not inequitable to deny a patent holder more than one certificate for a product whilst allowing other patent holders one certificate for that product. Therefore, since one application had been granted the further application from the applicant for the same product was rejected.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O13805.pdf", "Status": "Activated"}, {"BLNumber": "O/140/05", "ConcerningRightsIn": "GB0301315.8", "HearingOfficer": "Mr H Jones", "DecisionDate": "2005-05-24T00:00:00", "PersonOrCompanyInvolved": "Launch Media, Inc.", "ProvisionsDiscussion": "PA.1977 section 1(2)(c)", "HearingType": "Ex", "Keywords": "Excluded fields (refused)", "RelatedDecisions": "None", "Summary": "The application relates to a system for streaming audio and video data to an individual over the Internet and for establishing a community of individuals based on similar musical tastes. The application acknowledges that online systems for streaming audio and video data to individuals are known, the substance of the invention being found to lie in determining the content to be broadcast to a particular community. The Hearing Officer found that the invention was excluded as a business method and that it lacked the technical contribution required to make such an excluded invention patentable.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O14005.pdf", "Status": "Activated"}, {"BLNumber": "O/143/05", "ConcerningRightsIn": "EPO(UK) 1,048,609 B1", "HearingOfficer": "Mr S Probert", "DecisionDate": "2005-05-23T00:00:00", "PersonOrCompanyInvolved": "Neil Eric Paxman v Derek Hughes", "ProvisionsDiscussion": "PA. 1977 section 37(1)(c), section 36", "HearingType": "Inter", "Keywords": "Licences, Striking out", "RelatedDecisions": "None", "Summary": "The patent relates to a new type of drinks cooler, and is owned jointly by the two parties. The two men set up a company to sell the new drink coolers; they are both directors of that company. However, only a very small number of the coolers have been sold because the co-proprietors have fallen out.Mr Paxman wants to grant licences to third parties to manufacture and supply drinks coolers under the patent, but because Mr Hughes (a co-owner of the patent) does not consent, he needs an order from the Comptroller to allow him to grant such licences.The hearing officer found that the Comptroller does have discretion to order the grant of such licences against the wishes of a co-proprietor when, and only when, it is necessary to prevent the proper exploitation of a patent being unreasonably prevented by one or more co-owners. But in this case, the claimant’s fiduciary duties as a company director prevent him from doing any of the things that he was asking the Comptroller to authorise him to do. Therefore the action was struck out before any evidence was filed.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O14305.pdf", "Status": "Activated"}, {"BLNumber": "O/145/05", "ConcerningRightsIn": "GB 2354263", "HearingOfficer": "Mrs S Williams", "DecisionDate": "2005-05-26T00:00:00", "PersonOrCompanyInvolved": "Spencer Wright Industries Inc, Neale Bennett, Alan Reid and Frank Shanley", "ProvisionsDiscussion": "PA..Act 1977 Section 13(1)", "HearingType": "Inter", "Keywords": "Inventorship", "RelatedDecisions": "None", "Summary": "As a result of an uncontested application filed under section 13(1) by Frank Shanley, it was found that he should be mentioned as a joint inventor in the granted patent and directed that an addendum slip mentioning him as a joint inventor be prepared for the published patent application and for the granted patent for the invention.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O14505.pdf", "Status": "Activated"}, {"BLNumber": "O/146/05", "ConcerningRightsIn": "GB 2331295", "HearingOfficer": "Mr P Back", "DecisionDate": "2005-05-26T00:00:00", "PersonOrCompanyInvolved": "Spears Limited v Skerra Pty Limited", "ProvisionsDiscussion": "PA 1977 Section 72", "HearingType": "Inter", "Keywords": "Revocation", "RelatedDecisions": "O/236/04", "Summary": "The patent concerns a valve (known as a spear) for filling and emptying beer kegs. The inside of the valve body has a chamber shaped with a narrowing section followed by a diversion plate at its outlet so that beer flowing into the keg during filling is directed onto the diversion plate and is deflected sideways to reduce turbulence during filling. The claimant alleged this was known in the light of various physical examples and drawings of prior valves which had similar structure. However there was little in the way of textual disclosure, expert evidence or experimental evidence to support the claimant’s interpretation of the operation of the prior valves. The term \"diversion plate\" in the main claim was construed by the hearing officer to mean a plate which diverts substantially the whole of the flow laterally. The hearing officer also decided that the narrowing of the fluid guide and the diversion plate were cooperating structures and not simply a collocation of features. The prior art was not found to demonstrate that the inventive construction was known or obvious. Costs were awarded above the comptroller’s normal scale in view of unnecessary delay by the claimant in assembling its case, which occasioned adjournment of the original hearing.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O14605.pdf", "Status": "Activated"}, {"BLNumber": "O/147/05", "ConcerningRightsIn": "GB 2314392", "HearingOfficer": "Mr R C Kennell", "DecisionDate": "2005-05-27T00:00:00", "PersonOrCompanyInvolved": "Marks & Clerk plc v Oystertec plc", "ProvisionsDiscussion": "PA.1977 sections 72(1), 75, 76(2)", "HearingType": "Inter", "Keywords": "Revocation", "RelatedDecisions": "O/298/02, O/525/02", "Summary": "The application was decided on the papers in the absence of anyone apparently interested in defending it, the defendant and still-named proprietor after some delay (reflected in the costs awarded) having said it was not a proper person to do so following court proceedings concerning entitlement. The hearing officer assumed that the defendant no longer wished to pursue amendments it had previously offered under section 75 and refused to accept them since they would not have been allowable in any case. The hearing officer found that the patent was invalid (i) under section 72(1)(d) by including matter extending beyond that in the application as filed because the claims had been redrafted to cover a construction in one of the Figures not initially suggested to be part of the invention; and (ii) under section 72(1)(a) because claim 1 lacked inventive step in the light of each of two cited specifications plus common general knowledge in the art. However he did not accept that the patent was invalid under section 72(1)(c) for insufficiency by reason of ambiguity. The hearing officer refused to allow a further opportunity to amend, and ordered revocation.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O14705.pdf", "Status": "Activated"}]