[{"BL_number": "O/007/21", "Concerning_rights_in": "GB1618927.6", "Hearing_Officer": "Mr P Thorpe", "Decision_date": "2021-01-06T00:00:00", "Person_s__or_Company_s__involved": "Lenovo (Singapore) Pte. Ltd", "Provisions_discussed": "Patents Act 1977 S1(2)", "Keywords": "Excluded fields (refused)", "Related_Decisions": "None", "Summary": "The invention relates to projecting battery usage on a device such as a computer or mobile phone. More specifically, it involves determining an estimated length of time for which a battery will power an apparatus based on a user selection of applications that they desire to use concurrently and on how long they wish to use each application for. Applying the Aerotel approach, the Hearing Officer found the invention to be excluded as a program for a computer. The application was refused.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O00721.pdf"}, {"BL_number": "O/012/19", "Concerning_rights_in": "GB1811004.9", "Hearing_Officer": "Mr B Buchanan", "Decision_date": "2019-01-09T00:00:00", "Person_s__or_Company_s__involved": "Akron Brass Company", "Provisions_discussed": "Patents Act 1977 Sections: 1(1), 14(5), 15(9), 21(1), 76(2), 91(1), 91(2), 130(6), 130(7); Patents Rules 2007: 19, 29(3)(b), 29(4)(a), 29(4)(b), 30(4) European Patent Convention: Article 115", "Keywords": "Clarity, Divisional application, Section 20 period, Support, Third party observations", "Related_Decisions": "None", "Summary": "This decision considers the issue of whether patent application GB1811004.9 can be accorded divisional status by virtue of being filed on time if the compliance period of the parent is extended under rule 30(4). To satisfy rule 30(4), an examination report on the parent issued following third party observations under section 21 must constitute a ‘first observations report’ according to rules 29(3)(b) and 29(4).If it does, under rule 30(4), the remaining rule 30 period of the parent is extended to 3 months from the date on which the first observations report was sent and the present divisional application may then be treated as having been filed in time. If not, the compliance period on the parent will only have been extended as of right by two months and the divisional will have been filed four days late. In this event, an auxiliary request was made to accept the application as a late filed divisional.The Hearing Officer heard arguments, inspired by the Court of Appeal’s judgment in Genentech Inc.’s Patent, that observations in respect of compliance with section 14(5) constitute observations on patentability permitted under section 21; that under section 130(7) of the Act, section 14(5) should, as nearly as practicable, have the same effect as the corresponding provision of the EPC; and that although not explicitly provided for in section 130(7), IPO practice in respect of sections 21 and 76(2) should be in harmony with the EPC and EPO guidelines consistent with section 91(1)(c) of the Act.He carefully considered the arguments and the wording of the Act and Rules which refer to “patentability” and a “patentable invention” and found that observations on clarity, support and added matter relating to sections 14(5) and 76(2) did not meet the requirements of section 21 and rule 29(4)(a).He then considered whether the examiner had reported as a consequence of the observations and analysed both the argument that the examiner’s report had “followed and mirrored” the observations in part, and the facts that the examiner’s report was not consistent with all of the observations and that the report was based on no new information. On balance he decided that rule 29(4)(b) was not met.Finally, the Hearing Officer considered whether the circumstances were exceptional and that the applicant had been properly diligent such as to exercise the Comptroller’s discretion to allow the application to proceed as a late filed divisional. He decided that the circumstances were not exceptional prior to the divisional application being filed and the applicant had not been diligent despite filing the application quickly once the deadline for doing so had passed. He decided that the Comptroller will not exercise discretion to allow the late filing and so the application may not be accorded divisional status under section 15(9).", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O01219.pdf"}, {"BL_number": "O/020/19", "Concerning_rights_in": "GB1500399.9 & GB1604348.1", "Hearing_Officer": "Mr P Mason", "Decision_date": "2019-01-11T00:00:00", "Person_s__or_Company_s__involved": "Tracy Buckland", "Provisions_discussed": "Patents Act 1977 sections 1(1)(b), 3, 14(3), 76(2)", "Keywords": "Added subject matter, Inventive step, Sufficiency", "Related_Decisions": "None", "Summary": "The applications each relate to a patient monitoring system comprising a wrist strap which communicates with a physician’s tablet or digital clipboard. The wrist strap comprises various sensors to monitor vital signs of the patient, and both the wrist strap and tablet have a wide range of functionality to support patient monitoring. The Hearing Officer found that the invention defined by claim 1 of GB1500399.9 would not have been obvious to a skilled person. However, he considered that claim 1 was a collocation of known or obvious parts, and therefore not inventive. The Hearing Officer also found that the claimed invention of GB1500399.9 was not sufficiently disclosed by the application as filed. Although amendment to make the claims of GB1500399.9 inventive may have been possible, the Hearing Officer considered that no amendment was possible that could provide a claimed invention that is sufficiently disclosed. The Hearing Officer therefore refused GB1500399.9. The Hearing Officer found that amendments to claim 2 of GB1604348.1, when correctly construed, did not add subject matter to the application. He also found that the invention defined by claim 1 of GB1604348.1 would not have been obvious to a skilled person, and nor was it a collocation of known or obvious parts. The Hearing Officer therefore remitted GB1604348.1 back to the examiner for further consideration.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O02019.pdf"}, {"BL_number": "O/029/19", "Concerning_rights_in": "GB1116031.4", "Hearing_Officer": "Mrs S E Chalmers", "Decision_date": "2019-01-16T00:00:00", "Person_s__or_Company_s__involved": "General Electric Company", "Provisions_discussed": "Patents Act Section 1(2)", "Keywords": "Excluded fields (allowed)", "Related_Decisions": "None", "Summary": "The invention relates to evaluating the operation of a generator using a computer by obtaining diagnostic data from one or more sensors in the generator, determining whether an anomaly exists using a knowledge base and if so providing a fault code to a user indicating the nature of an error that caused the anomaly.The Hearing Officer applied the four-step approach set out in Aerotel/Macrossan in the light of the AT&T and HTC judgments but was unable to identify an actual contribution in view of prior art identified by the examiner. The alleged contribution of the invention was considered and found to be more than a program for a computer as such. The application has been remitted back to the examiner for further substantive examination.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O02919.pdf"}, {"BL_number": "O/033/19", "Concerning_rights_in": "EP(UK)3115508", "Hearing_Officer": "Mrs S Eaves", "Decision_date": "2019-01-18T00:00:00", "Person_s__or_Company_s__involved": "Wirtgen GmbH, Philip Verhaelen, Cyrus Barimani, Günter Hähn, Juri Wagner, Stefan Jentsch, Bastian Schings, Dr. Kevin Helmut Schmitz and Dr. Felix Johannes Van Der Beek", "Provisions_discussed": "PA Act 1977 Section 13(1)", "Keywords": "Inventorship", "Related_Decisions": "None", "Summary": "An uncontested application was filed by Wirtgen GmbH, the patent proprietor, under rule 10(2) of the Patents Rules 2007. As a result, it was found that Juri Wagner, Stefan Jentsch, Bastian Schings, Dr. Kevin Helmut Schmitz and Dr. Felix Johannes Van Der Beek should be mentioned as joint inventors.It was also directed that an addendum slip be prepared to reflect this for the granted patent for the invention.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O03319.pdf"}, {"BL_number": "O/035/21", "Concerning_rights_in": "GB 2007535.4", "Hearing_Officer": "Mrs C L Davies", "Decision_date": "2021-01-14T00:00:00", "Person_s__or_Company_s__involved": "Tate and Lyle Technology Limited and Tate & Lyle Ingredients Americas LLC", "Provisions_discussed": "Patents Act 1977 Section 1(1)(b)", "Keywords": "Inventive step", "Related_Decisions": "None", "Summary": "The invention concerns a protein comprising a polypeptide that has at least 90% sequence identity with but is not identical to a peptide sequence identified as SEQ ID NO: 6 and which has psicose 3-epimerase activity. Nucleic acids encoding this peptide, vectors and host cells comprising the encoding nucleic acid are further claimed. This enzyme catalyses the interconversion of fructose to allulose.The examiner, based on the prior art disclosure of SEQ ID NO:6 in protein databases and the common general knowledge of the skilled person, asserted that the invention was obvious. The applicants disagreed with the examiner’s starting point for assessing obviousness and assessment of the common general knowledge and maintained their assertion that there was an inventive step to arrive at the claimed invention.Having carefully considered the arguments, observations and evidence presented, the Hearing Officer agreed with the applicants’ assessment of the common general knowledge of the skilled person and the starting point for assessing obviousness. In the light of this following the Windsurfing/Pozzoli approach, the Hearing Officer found that the claims 1-9 required an inventive step over the prior art.The application was remitted back to the examiner for completion of the examination process and grant.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O03521.pdf"}, {"BL_number": "O/037/21", "Concerning_rights_in": "GB1612429.9", "Hearing_Officer": "Miss J Pullen", "Decision_date": "2021-01-14T00:00:00", "Person_s__or_Company_s__involved": "Smartglyph Limited", "Provisions_discussed": "Patents Act 1977 sections 1(2)", "Keywords": "Excluded fields (refused)", "Related_Decisions": "None", "Summary": "The invention relates to a system for scanning codes and to a system for augmenting scannable codes to provide enhanced information and content. When an element is scanned a check is performed to see whether the information in the element is associated with a two-dimensional code in a database. When a match is found, the two-dimensional code is decoded and a vector is provided to identify rich media, such as videos, images and documents, that are then forwarded to the scanning device.The hearing officer rejected the applicant’s construction of the claim and found that the contribution related to the linking of the scannable element to the two-dimensional code in the database and this does not make a technical contribution. The application was refused as a program for a computer as such under section", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O03721.pdf"}, {"BL_number": "O/042/19", "Concerning_rights_in": "GB 1420108.1", "Hearing_Officer": "Mr S Brown", "Decision_date": "2019-01-22T00:00:00", "Person_s__or_Company_s__involved": "International Business Machines Corporation", "Provisions_discussed": "PA 1977 Section 1(2)", "Keywords": "Excluded fields (refused)", "Related_Decisions": "None", "Summary": "The application provides a way of detecting the unauthorised bulk transfer of emails from a first network to a second network. It does this by determining an arrival rate for internal emails into one or more accounts within the first network and then undertaking a further determination of emails being sent to an external network. By comparing the arrival and sending rates it is able to identify if mail is being bulk forwarded.The Hearing Officer applied the reasoning in Aerotel/Macrossan and considered the AT&T/Cvon signposts as modified by HTC v Apple and found that the contribution lay entirely in matter excluded as a program for a computer as such. He also considered the guidance in Merrill Lynch and Halliburton and decided that it was also excluded as a method of doing business.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O04219.pdf"}, {"BL_number": "O/042/21", "Concerning_rights_in": "GB1714567.3", "Hearing_Officer": "Mr P Mason", "Decision_date": "2021-01-14T00:00:00", "Person_s__or_Company_s__involved": "David John Jones", "Provisions_discussed": "Patents Act 1977 Section 14(3), Section 14(5)(b) and Section 76(2)", "Keywords": "Added subject matter, Clarity, Sufficiency", "Related_Decisions": "None", "Summary": "The application concerns a profile for a bricklayer’s tool. The tool comprises a staff, a clamp, and an arrangement of bolts and handwheels to allow positioning. The main claim is directed to extrusion dies to produce said tool. The hearing officer considered whether the invention was sufficiently disclosed as required by Section 14(3); whether the amended claim disclosed added matter as set out in Section 76(2); and whether the amended claim clearly defined the scope of the invention as required by Section 14(5)(b). The hearing officer found that the application was not sufficiently disclosed and was not clear enough to be performed by a skilled addressee. As such it was not necessary to give further consideration of the added subject matter. The application was refused under Section 18(3).", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O04221.pdf"}, {"BL_number": "O/045/21", "Concerning_rights_in": "GB1505456.2", "Hearing_Officer": "Miss J Pullen", "Decision_date": "2021-01-15T00:00:00", "Person_s__or_Company_s__involved": "Renaissance Technologies LLC", "Provisions_discussed": "Section 1(2)", "Keywords": "Excluded fields (refused)", "Related_Decisions": "None", "Summary": "The invention relates to a computer-based financial trading system and method capable of executing time synchronized trades in multiple exchanges. The system includes a plurality of servers co-located at the financial exchanges and a trading server. The trading server sends multiple financial trade instructions containing orders and an execution time to each of the co-located servers to be submitted to the financial exchange at the execution time whereby the orders are received at the exchanges substantially simultaneously.The Hearing Officer applied the Aerotel/Macrossan four step test, considered the AT&T/CVON signposts and found that the contribution fell within the excluded categories of a business method and a computer program as such. The application was refused under section 18(3).", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O04521.pdf"}, {"BL_number": "O/055/21", "Concerning_rights_in": "GB1720232.6", "Hearing_Officer": "Mr H Jones", "Decision_date": "2021-01-21T00:00:00", "Person_s__or_Company_s__involved": "Motorola Solutions Inc.", "Provisions_discussed": "Section 1(2)(c)", "Keywords": "Excluded fields (refused)", "Related_Decisions": "None", "Summary": "The invention relates to automatically matching ‘user profiles’ to ‘role profiles’ in an emergency incident using machine learning to optimise the deployment of the individuals (‘users’) to the different roles. The computer-based system uses a ‘combinatorial optimisation routine’ to automatically assign particular roles to each user profile using a suitability score. The suitability score is calculated using user profile data (e.g. training records, user experience), and the geographical location of the user. Each user has a communications device which is used to inform them of their assignment. The user devices can function differently depending on the role assigned, and the system is adaptive so that should the incident requirements change, the users can be deployed/redeployed differently.Having assessed the problem addressed by the invention as ensuring efficient allocation of personnel in an incident based on the information available and in providing personnel with the relevant tools to perform their roles effectively, the hearing officer found the invention to be excluded as a computer program and a method of doing business. The application was refused.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O05521.pdf"}, {"BL_number": "O/057/19", "Concerning_rights_in": "GB2490817", "Hearing_Officer": "Mr B Buchanan", "Decision_date": "2019-01-28T00:00:00", "Person_s__or_Company_s__involved": "Masimo Corporation", "Provisions_discussed": "Patents Act 1977 Sections: 1(1), 1(2), 3", "Keywords": "Claim construction, Excluded fields (refused), Inventive step", "Related_Decisions": "None", "Summary": "This decision considers the issue of whether patent application GB1212698.3 is excluded from patentability as a program for a computer and/or a method for doing business. The Hearing Officer also considered whether the claims define an inventive step including whether they define separate integers which provide a mere collocation of features. The application claims a wellness analyser having two modes of operation: a diagnosis mode and a simulation mode for analysing the health of a patient on the basis of information from sensors and databases. The Hearing Officer applied the Aerotel/Macrossan test and considered the signposts laid out in HTC v Apple and decided that the contribution made by the invention fell solely within excluded subject matter. The Hearing Officer assessed the obviousness of the claims under Windsurfing/Pozzoli and found that they did define an inventive step and that the integers were synergistically linked.The application was refused as no more than a program for a computer and a method for doing business as such. Three sets of auxiliary claims were considered and also found to be excluded from patentability.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O05719.pdf"}, {"BL_number": "O/057/21", "Concerning_rights_in": "GB1713282.0", "Hearing_Officer": "Miss J Pullen", "Decision_date": "2021-01-22T00:00:00", "Person_s__or_Company_s__involved": "Kira Inc.", "Provisions_discussed": "Patents Act 1977 section 1(2)", "Keywords": "Excluded fields (refused)", "Related_Decisions": "None", "Summary": "The invention relates to searching through an electronic text document for passages relating to a desired concept by using a conditional random field algorithm (a class of statistical modelling). A set of training texts are deconstructed by a computer processor to extract features including the text of complete sentences, tokens used in those sentences, the sequencing of those sentences, and the layout and typography of the text. The conditional random field algorithm applies one of two labels to each sentence: relevant to the concept being searched for (also known as “State A”), or background information (“State B”). A search algorithm then returns all those sentences which have been labelled with “State A”, i.e. those sentences relevant to the concept being searched for.Applying the Aerotel approach, the Hearing Officer found the contribution fell within the excluded matter as a program for a computer as such. The application was refused.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O05721.pdf"}, {"BL_number": "O/065/21", "Concerning_rights_in": "GB1900276.5", "Hearing_Officer": "Mr B Buchanan", "Decision_date": "2021-01-28T00:00:00", "Person_s__or_Company_s__involved": "Alexander Scott Ross", "Provisions_discussed": "Sections 1(1)(c), 4(1) and 14(3) of the Patents Act 1977", "Keywords": "Industrial application, Sufficiency", "Related_Decisions": "None", "Summary": "The claimed invention relates to a system for propelling a space craft. The invention works by using a non-contacting magnetic coupling between a motor-driven wheel, and the hull of the space craft, to exert a force on the hull of the craft. The motor is fixed to the hull of the space craft so that if the space craft moves, the motor and wheel move with it. The alleged advantage when used in space is that by using magnets, without direct mechanical contact between each wheel and the hull, there is no reaction to the force on the hull applied by the magnetic wheel as it rotates. This then, allegedly, means that the craft experiences no resistance to thrust and continuously accelerates while the force is applied.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O06521.pdf"}, {"BL_number": "O/606/20", "Concerning_rights_in": "GB1903876.9", "Hearing_Officer": "Mr H Jones", "Decision_date": "2020-12-01T00:00:00", "Person_s__or_Company_s__involved": "David Smith", "Provisions_discussed": "Section 1(1)(c)", "Keywords": "Industrial application", "Related_Decisions": "None", "Summary": "The invention is described as a rotor unit operable to rotate about a rotational axis. It is described as a power generation apparatus and the examiner considered this to mean that the overall system created energy from nothing, which would be contrary to well-established physical laws and therefore incapable of industrial application. When taken as a whole, the hearing officer concluded that the reference to power generation in the application simply meant a transfer of energy from one form to another as opposed to energy creation. The invention was found to be capable of industrial application and the application was remitted to the examiner.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O60620.pdf"}, {"BL_number": "O/610/20", "Concerning_rights_in": "SPC/GB17/075", "Hearing_Officer": "Dr L Cullen", "Decision_date": "2020-12-04T00:00:00", "Person_s__or_Company_s__involved": "Erber Aktiengesellschaf", "Provisions_discussed": "Regulation (EC) 469/2009, Articles 2; 3(b); 7 Directive 2001/82/EC (Veterinary Medicinal Products Directive) Regulation (EC) 1831/2003 (Animal Nutrition Additives Regulation)", "Keywords": "Supplementary Protection Certificates", "Related_Decisions": "None", "Summary": "This application is the first of two applications for an SPC for the active substance “microorganism DSM 11798 of the Coriobacteriaceae family”. The authorisation provided in support of the application comprises two Commission Implementing Regulations which approve the use of this microorganism as an additive in animal feed. The microorganism reduces the contamination of animal field by mycotoxins, particularly trichothecenes, in feed for pigs (dating from 2013) and in feed for all avian species (from 2017). These approvals were granted by the European Commission under Regulation (EC) 1831/2003 which relates to additives for use in animal nutrition. The applicant argued that the approval granted under Regulation (EC)1831/2003 is equivalent to an authorisation granted under the Veterinary Medicinal Products Directive (Directive 2001/82/EC) and as such it can be used in support of an SPC application.The hearing officer (HO), adopting a suitable teleological approach and taking account of earlier IPO decisions (O/141/14 (Cerus); O/328/14 (Liebniz) and O/466/15 (Angiotech), considered both the wording and the overall scheme and objectives of the three European legislative instruments involved (the SPC Regulation, the Animal Nutrition Additives Regulation and the Veterinary Medicinal Products Directive). Finding support from CJEU decision C-527/17, Boston Scientific, the HO concluded that the approvals provided in support of this SPC application did not meet the requirement under Article 2 of the SPC regulation that the product has been subject of an “administrative procedure as laid down in Directive 2001/82/EC.” Accordingly, the application did not fulfil the requirement under Article 3(b) to furnish a valid authorisation “to place the product on the market as a medicinal product granted in accordance with Directive 2001/82/EC” in support of this SPC application.As the application failed to meet the requirements for grant laid down in the SPC Regulation, it was rejected under Article 10(2).", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O61020.pdf"}, {"BL_number": "O/612/20", "Concerning_rights_in": "GB1517371.9", "Hearing_Officer": "Mrs C L Davies", "Decision_date": "2020-12-07T00:00:00", "Person_s__or_Company_s__involved": "ProEventa, Inc.", "Provisions_discussed": "PA 1977 Sections 1(2)(c), 1(2)(d) and 76", "Keywords": "Added subject matter, Excluded fields (refused)", "Related_Decisions": "None", "Summary": "The application discusses why it is important to recognize and treat problems and issues that prevent goals and other objectives from being achieved. However, electronic systems, equipment, software, and processes for tracking, treating, and recording results, such as for individuals with special needs, have not improved as significantly. For example, some organizations still use paper documents and charts to track individuals' information or a single computing system available from only one location to enter and review data. As a result, viewing, updating, managing, and sharing, relevant information may be more difficult than it should be.The invention relates to a system and method for tracking outcome specific data. This is achieved by receiving input that defines accounts for service providers as part of a client management programme, where the accounts are stored in a server. Clients are assigned to at least one provider as selected by an administrator. Providers are prompted automatically to provide health data about each of the clients and periodically sending/updating that data. The data received from the providers is compiled and a rule is set to obtain a score associated with the clients’ progress against at least one goal using devices communicating with the server. The compiled data and the score are analysed to determine a status of the client and whether the data has reached a threshold to become significant. Upon the threshold becoming significant an alert including the compiled data is automatically communicated to the provider assigned to the client.The Hearing Officer agreed with the examiner’s reasoning which followed the four step Aerotel test to determine whether there was a technical contribution and applied the AT&T signposts as modified in HTC. The contribution was not found to provide the required technical effect and the claimed invention related solely to a program for a computer and a method for doing business as such, so the application did not meet the requirements of section 1(2)(c). The Hearing Officer also agreed with the examiner that a dependent claim also relates to presentation of information and therefore not meeting the requirement of section 1(2)(d). The Hearing Officer also agreed with the examiner in considering the claims to contain added matter, so the application did not meet the requirements of section 76. The application was refused under section 18(3).", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O61220.pdf"}, {"BL_number": "O/621/20", "Concerning_rights_in": "GB1615620.0", "Hearing_Officer": "Mr B Micklewright", "Decision_date": "2020-12-11T00:00:00", "Person_s__or_Company_s__involved": "Tree House Technologies Limited", "Provisions_discussed": "Patents Act 1977 sections 1(1)(d), 1(2)(c)", "Keywords": "Excluded fields (refused)", "Related_Decisions": "None", "Summary": "The invention related to a messaging system for individuals in which the messages included options which could be selected by individuals. These selected options are then used to update the message for all individuals in the group. The invention could be used for allocating components of a task to individuals, or for collective decision making. The hearing officer found that the contribution related to improvements in an administrative process rather than to technical improvements in a communication system. It did not make a technical contribution. He therefore refused the application as a program for a computer as such and a method of doing business as such under sections 1(1)(d) and 1(2)(c) of the Act.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O62120.pdf"}, {"BL_number": "O/627/20", "Concerning_rights_in": "GB1603980.2", "Hearing_Officer": "Mrs C L Davies", "Decision_date": "2020-12-14T00:00:00", "Person_s__or_Company_s__involved": "Oxford Instruments Industrial Products Limited", "Provisions_discussed": "PA 1977 Section 1(1)(b)", "Keywords": "Inventive step", "Related_Decisions": "None", "Summary": "The invention is concerned with analysing an animal tissue sample in order to establish its provenance, specifically identifying the animal source. This is done using a nuclear magnetic resonance (NMR) spectrometer having a permanent magnet with a magnetic field strength at a sample holder of the spectrometer between 1.0 and 2.5 Tesla (low-field NMR spectrometer), and subsequently analysing the triglyceride signature NMR spectrum from the tissue sample.Following the Windsurfing/Pozzoli approach, the Hearing Officer found that the claims 1-20 lacked an inventive step over the prior art.The Hearing Officer considered to an auxiliary claim set submitted by the applicant and remitted the application back to the examiner to complete the examination process", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O62720.pdf"}, {"BL_number": "O/632/20", "Concerning_rights_in": "GB1903870.2", "Hearing_Officer": "Mr B Buchanan", "Decision_date": "2020-12-15T00:00:00", "Person_s__or_Company_s__involved": "QCIC Ltd", "Provisions_discussed": "Patents Act 1977 section 1(2)(c) & 76(2)", "Keywords": "Excluded fields (refused)", "Related_Decisions": "None", "Summary": "The claimed invention relates to a method of identifying and programming devices to be installed in an environment, such as access control devices in a building, and a system for doing the same. Firstly the Hearing Officer considered whether amendments to the claims made upon entering the national phase constituted added matter and concluded that they did not, because after reading the original specification, which used different terminology in parts, and considering how the invention would be implemented in practice, the skilled person would learn nothing new from the amended claims.Finally the Hearing Officer followed the four step Aerotel/Macrossan test to determine whether there was a technical contribution and considered the AT&T signposts. The identified contribution was not found to provide the required technical effect and the claimed invention was found to relate solely to a program for a computer as such, so the application did not meet the requirements of section 1(2)(c). The application was refused under section 18(3).", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O63220.pdf"}, {"BL_number": "O/633/20", "Concerning_rights_in": "GB1710518.0", "Hearing_Officer": "Mr P Thorpe", "Decision_date": "2020-12-15T00:00:00", "Person_s__or_Company_s__involved": "Motorola Solutions, Inc.", "Provisions_discussed": "Patents Act 1977(1)(2)", "Keywords": "Excluded fields (refused)", "Related_Decisions": "None", "Summary": "The invention relates to dispatching different types of law enforcement patrols in order to achieve a desired deterrent effect on patrol routes. The invention receives information from a law enforcement patrol relating to the nature of the patrol, for example whether it is on foot or by vehicle, and the route that is being taken by that patrol. The invention determines an achieved deterrence effect of that patrol. Historical and/or real-time crime information is used by the invention to then determine a difference between a desired threshold level of deterrence and the achieved level of deterrence for a particular patrol route. The invention will then identify an available type of law enforcement patrol that will compensate for the difference and then cause an available law enforcement patrol to be dispatched to the particular patrol route.The Hearing Officer found the invention to be excluded as a computer program, the presentation of information and as a method of doing business and therefore refused the application.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O63320.pdf"}, {"BL_number": "O/636/20", "Concerning_rights_in": "GB1505704.5", "Hearing_Officer": "Miss J Pullen", "Decision_date": "2020-12-16T00:00:00", "Person_s__or_Company_s__involved": "Gas Tag Ltd.", "Provisions_discussed": "Section 1(2), 76(2)", "Keywords": "Added subject matter, Excluded fields (refused)", "Related_Decisions": "None", "Summary": "The invention relates to a computer-based system for monitoring maintenance of multiple appliances at multiple premises which uses machine readable tags recording an identifier mounted in physical association with the appliances. A portable processing device is provided with a tag reader, a user interface to receive maintenance data input by the maintenance operative and an interface for exchanging data with a remote server. The remote server stores maintenance data for the appliances and has a user interface for providing the maintenance data to users such as landlords, tenants and contractors.The Hearing Officer found that the latest amendments to the application added matter that is not unambiguously disclosed, either explicitly or implicitly in the application. Disregarding the added matter, the Hearing Officer applied the Aerotel/Macrossan four step and found that the contribution fell within the excluded categories as a business method as such. The application was refused under section 18(3).", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O63620.pdf"}, {"BL_number": "O/641/20", "Concerning_rights_in": "GB1514746.5", "Hearing_Officer": "Mr B Micklewright", "Decision_date": "2020-12-17T00:00:00", "Person_s__or_Company_s__involved": "Island Abbey Foods Ltd.", "Provisions_discussed": "Patents Act 1977 sections 1(1)(b) and 3", "Keywords": "Inventive step", "Related_Decisions": "None", "Summary": "The invention related to a molasses product consisting essentially of a molasses having a moisture content equal to or less than about 0.5% (w/w), and to a process for obtaining this molasses product which consisted of heating the molasses to a temperature of at least 70°C while applying a vacuum of at least 711 mmHg (28 inHg), and maintaining these conditions until the moisture content reached 0.5% (w/w). The examiner had argued that the invention did not involve an inventive step over the common general knowledge alone and over three prior art documents. The hearing officer found that he did not have sufficient evidence to conclude that the invention did not involve an inventive step over the common general knowledge alone. He did however conclude that vacuum-drying processes for dehydrating molasses would have been well known to the skilled person, as would the desirability of minimising moisture content in molasses products, noting that there were few specific details of such processes disclosed in the application in suit. The hearing officer, considering the common general knowledge of the skilled person and the disclosure of each of the three documents, found that the present invention did not involve an inventive step over each of the three documents when considered in the context of the person skilled in the art’s common general knowledge. He therefore refused the application.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O64120.pdf"}, {"BL_number": "O/643/20", "Concerning_rights_in": "GB1801845.7", "Hearing_Officer": "Mr P Mason", "Decision_date": "2020-12-17T00:00:00", "Person_s__or_Company_s__involved": "XIHUA UNIVERSITY", "Provisions_discussed": "Patents Act 1977 Section 1(2) and Section 14(5)", "Keywords": "Clarity", "Related_Decisions": "None", "Summary": "The invention concerns mining database items and sequencing data in order to improve computational speed. The examiner formed the view the claims of the application were unclear and that they concerned an excluded invention, inasmuch as they could be construed.The hearing officer found the claims to be ambiguous, noting the applicant provided no reasoned response to the examiner’s last report. Consequently, the hearing officer was unable to form a view on whether the invention was excluded. The application was refused under Section 18(3).", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O64320.pdf"}, {"BL_number": "O/647/20", "Concerning_rights_in": "GB1521192.3 GB1521193.1", "Hearing_Officer": "Mr P Thorpe", "Decision_date": "2020-12-22T00:00:00", "Person_s__or_Company_s__involved": "Suunto OY", "Provisions_discussed": "Patents Act 1977 s1(2)", "Keywords": "Excluded fields (refused)", "Related_Decisions": "None", "Summary": "GB1521192.3 and GB1521193.1 both disclose smart watches that are able to detect the location of the watch and then suggest an activity route to the user based on the location and other information contained in a thematic database. This could be information relating to pollution or crime levels in the area or information relating to the type of activities already undertaken in the area. The hearing officer did not consider there to be a technical contribution in either application and therefore refused each of them as relating to a computer program.", "PdfLink": "https://www.ipo.gov.uk/p-challenge-decision-results/O64720.pdf"}]